fabrika/src/Documents/ЗаявкаНаМашину/ЗаявкаНаМашину.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаМашину</name>
  <registerRecords>AccumulationRegister.Таможня</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Таможня</name>
    <type>
      <types>CatalogRef.Таможни</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерМашины</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерГТД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТаможенныйПлатёж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрихода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипМашины</name>
    <comment>Тип содержимого машины</comment>
    <type>
      <types>EnumRef.ТипМашины</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаТамПлат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

fabrika/src/AccumulationRegisters/Таможня/Таможня.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Таможня</name>
  <resources>
    <name>СуммаUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТипДвижения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчётСписания</name>
    <comment>Счёт списания таможенных платежей</comment>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fabrika/src/Documents/ЗаявкаНаМашину/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Отказ = ПроверитьУникальностьМашины();  
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	ПроведениеПоРегиструТаможня();
	
КонецПроцедуры

//Проведение по регистру таможня
Процедура ПроведениеПоРегиструТаможня()
	
	// регистр Таможня Приход
	Движения.Таможня.Записывать = Истина;
	Движение = Движения.Таможня.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = ДатаПрихода;
	Движение.СчётСписания = СчётСписания;
	Движение.Организация = Организация;
	
	Если НЕ ЗначениеЗаполнено(ВалютнаяСтоимость) Тогда
		Движение.СуммаUSD = ТаможенныйПлатёж;
		
	Иначе
		Если ЗначениеЗаполнено(Валюта) Тогда
			Движение.СуммаФакт = СуммаТамПлат;
		Иначе
			Движение.СуммаФакт = ТаможенныйПлатёж;
		КонецЕсли;  
		
	КонецЕсли;	
		
	Движение.ТипДвижения = "Заявка на машину";
		
КонецПроцедуры


//=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>
Функция ПроверитьУникальностьМашины()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкаНаМашину.Ссылка
	               |ИЗ
	               |	Документ.ЗаявкаНаМашину КАК ЗаявкаНаМашину
	               |ГДЕ
	               |	ЗаявкаНаМашину.ПометкаУдаления = ЛОЖЬ
	               |	И ЗаявкаНаМашину.Ссылка <> &ТекущийОбъект
	               |	И ЗаявкаНаМашину.НомерМашины = &НомерМашины
	               |	И ГОД(ЗаявкаНаМашину.ДатаПрихода) = &Год
	               |	И ЗаявкаНаМашину.ВидМашины = &ВидМашины";
				   
	Запрос.УстановитьПараметр("ТекущийОбъект", Ссылка);
	Запрос.УстановитьПараметр("НомерМашины", НомерМашины);
	Запрос.УстановитьПараметр("ВидМашины", ВидМашины);
	Запрос.УстановитьПараметр("Год", Год(ДатаПрихода));
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() > 0 Тогда
		Для Каждого Документ Из Результат Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Строка(ВидМашины) + " не уникальна!!!", Документ.Ссылка, "НомерМашины");
		КонецЦикла;
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
		

КонецФункции // ПроверитьУникальностьМашины()
//=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>=>
